1. 데이터를 저장 후 몇 가지 문제를 코드로 작성합니다.

1-01

In [162]:
import pandas as pd

In [163]:
icecream={'이름':['메로나','비비빅','죠스바'],
          '가격':[300,400,250],
          '재고':[20,3,100]}
icecreamDF=pd.DataFrame(icecream)
icecreamDF

    이름   가격   재고
0  메로나  300   20
1  비비빅  400    3
2  죠스바  250  100

1-02

In [164]:
print(icecreamDF.index)
print(icecreamDF.columns)
print(icecreamDF.values)
print(icecreamDF.dtypes)
print(icecreamDF.ndim)
print(icecreamDF.shape)

RangeIndex(start=0, stop=3, step=1)
Index(['이름', '가격', '재고'], dtype='object')
[['메로나' 300 20]
 ['비비빅' 400 3]
 ['죠스바' 250 100]]
이름    object
가격     int64
재고     int64
dtype: object
2
(3, 3)

1-03

In [165]:
print(icecreamDF['가격'])

0    300
1    400
2    250
Name: 가격, dtype: int64

1-04

In [166]:
print(icecreamDF[['이름','재고']])

    이름   재고
0  메로나   20
1  비비빅    3
2  죠스바  100

1-05

In [167]:
print(icecreamDF.iloc[0,[1,2]])

가격    300
재고     20
Name: 0, dtype: object

1-06

In [168]:
print(icecreamDF[['가격','재고']])

    가격   재고
0  300   20
1  400    3
2  250  100

1-07

In [169]:
icecreamDF.index=['일','이','삼']
icecreamDF

    이름   가격   재고
일  메로나  300   20
이  비비빅  400    3
삼  죠스바  250  100

1-08

In [170]:
icecreamDF['총가격']=0
icecreamDF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0

1-09

In [171]:
icecreamDF.loc[4]=['빵빠레',550,10,0]
icecreamDF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0
4  빵빠레  550   10    0

1-10

In [172]:
icecreamDF.iloc[1,2]=23
icecreamDF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400   23    0
삼  죠스바  250  100    0
4  빵빠레  550   10    0

2-01

In [173]:
data=[
        [2000, 3050, 2050, 1980],
        [7500, 2050, 2050, 1980],
        [15450,15050,15550,14900]
]
dataDF=pd.DataFrame(data)
dataDF.columns=['시가','고가','저가','종가']
dataDF

      시가     고가     저가     종가
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900

2-02

In [174]:
print(dataDF.index)
print(dataDF.columns)
print(dataDF.values)
print(dataDF.dtypes)
print(dataDF.ndim)
print(dataDF.shape)

RangeIndex(start=0, stop=3, step=1)
Index(['시가', '고가', '저가', '종가'], dtype='object')
[[ 2000  3050  2050  1980]
 [ 7500  2050  2050  1980]
 [15450 15050 15550 14900]]
시가    int64
고가    int64
저가    int64
종가    int64
dtype: object
2
(3, 4)

2-03

In [175]:
dataDF.index=['2024-01-01', '2024-02-01', '2024-03-01']
dataDF

               시가     고가     저가     종가
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

2-04

In [176]:
dataDF.columns=['Open','High','Low','Close']
dataDF

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

2-05

In [177]:
print(dataDF.iloc[1][1::2])

High     2050
Close    1980
Name: 2024-02-01, dtype: int64

2-06

In [178]:
dataDF.loc['2024-04-01']=[3200,3550,3000,2990]
dataDF

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

2-07

In [179]:
dataDF=dataDF.drop('2024-01-01')
dataDF

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

2-08

In [180]:
dataDF.iloc[1,2]=14000
dataDF

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  14000  14900
2024-04-01   3200   3550   3000   2990

2-09

In [181]:
dataDF['Average']=0
dataDF

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
2024-04-01   3200   3550   3000   2990        0

2-10

In [182]:
dataDF['Total']=0
dataDF

             Open   High    Low  Close  Average  Total
2024-02-01   7500   2050   2050   1980        0      0
2024-03-01  15450  15050  14000  14900        0      0
2024-04-01   3200   3550   3000   2990        0      0

3-01 데이터
3-02 데이터프레임
3-03 시리즈
3-04 데이터프레임
3-05 어레이
3-06 시리즈
3-07 시리즈
3-08 데이터프레임